**`teams/nomis/rhel_7_9_oracledb_11_2`** terraform plan on `push` event [#478](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_component.this["../components/rhel_7_9_oracledb_11_2/database.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: Database
            description: Database provisioner component.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: "1.1.0"
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install, create, activate virtual environment
                          pip3.9 install virtualenv
                          mkdir /tmp/python-venv && cd "$_"
                          python3.9 -m venv ansible
                          source ansible/bin/activate
            
                          # Install ansible modules in virtual env
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
            
                          # Download playbook
                          mkdir /tmp/database-ansible-playbook && cd "$_"
          -               echo "Cloning using branch=feature/DSOS-1460"
          -               git clone -b feature/DSOS-1460 --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
          +               echo "Cloning using branch=main"
          +               git clone -b main --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # Install requirements in virtual env
                          python3.9 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          INSTANCE_ID=$(curl http://instance-data/latest/meta-data/instance-id)
                          PY_INTERPRETER=$(which python3.9)
                          ansible-playbook ../teams/nomis/ansible/playbooks/database-ami-provisioning.yml \
                          --connection=local \
                          --inventory localhost, \
                          --extra-vars "instance_id=$INSTANCE_ID ansible_python_interpreter=$PY_INTERPRETER s3_bucket_with_prefix=ec2-image-builder-nomis20220314103938567000000001/oracle-11g-software" \
                          --become \
                          --tags "all,opatch,patch,deconfig"
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -r /tmp/python-venv
                          rm -r /tmp/database-ansible-playbook
        EOT
      ~ date_created          = "2022-09-23T08:45:38.147Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.1.0/1" -> (known after apply)
        name                  = "Database"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_component.this["../components/rhel_7_9_oracledb_11_2/prometheus_script_exporter.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheusscriptexporter/1.0.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: PrometheusScriptExporter
            description: Component to install script exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.0.0
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  - name: InstallScriptExporter
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          cd /tmp
            
                          # install, create, activate virtual environment
                          pip3.9 install virtualenv
                          mkdir /tmp/python-venv && cd "$_"
                          python3.9 -m venv ansible
                          source ansible/bin/activate
            
                          # Install ansible modules in virtual env
                          python3.9 -m pip install --upgrade pip
                          python3.9 -m pip install ansible==6.0.0
            
                          # Download playbook
                          mkdir /tmp/script-exporter-ansible-playbook && cd "$_"
          -               echo "Cloning using branch=feature/DSOS-1460"
          -               git clone -b feature/DSOS-1460 --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
          +               echo "Cloning using branch=main"
          +               git clone -b main --single-branch "https://github.com/ministryofjustice/modernisation-platform-ami-builds.git"
                          cd modernisation-platform-ami-builds/ansible
            
                          # Install requirements in virtual env
                          python3.9 -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml
            
                          # Get required extra vars and run ansible
                          PY_INTERPRETER=$(which python3.9)
                          ansible-playbook ../teams/nomis/ansible/playbooks/script-exporter-install.yml \
                          --connection=local \
                          --inventory localhost, \
                          --extra-vars "ansible_python_interpreter=$PY_INTERPRETER" \
                          --become
            
                          # Deactivate virtual env and cleanup
                          deactivate
                          rm -r /tmp/python-venv
                          rm -r /tmp/script-exporter-ansible-playbook
        EOT
      ~ date_created          = "2022-09-23T08:31:53.954Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheusscriptexporter/1.0.0/1" -> (known after apply)
        name                  = "PrometheusScriptExporter"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-oracledb-11-2"
        name         = "nomis_rhel_7_9_oracledb_11_2"
      ~ tags         = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-oracledb-11-2" -> (known after apply)
      ~ date_created                     = "2022-09-23T08:45:43.248Z" -> (known after apply)
      ~ date_last_run                    = "2022-09-23T08:54:27.644Z" -> (known after apply)
      ~ date_next_run                    = "2022-10-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2022-09-23T08:45:43.248Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/nomis-rhel-7-9-oracledb-11-2" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.7" -> (known after apply) # forces replacement
        name                             = "nomis_rhel_7_9_oracledb_11_2"
      ~ platform                         = "Linux" -> (known after apply)
      ~ tags                             = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)


      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.7" -> (known after apply)
      ~ date_created     = "2022-09-23T08:45:41.265Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-oracledb-11-2/0.0.7" -> (known after apply)
        name             = "nomis_rhel_7_9_oracledb_11_2"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
        # (3 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdb" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdc" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 100 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sde" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdg" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdg"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdh" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdh"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdi" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdi"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdj" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sdk" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 1 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sdk"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 1
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/sds" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 4 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sds"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 4
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/database/1.1.0/1" -> (known after apply) # forces replacement
        }
      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheusscriptexporter/1.0.0/1" -> (known after apply) # forces replacement
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder["rhel_7_9_oracledb_11_2"].aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-oracledb-11-2-0-0-7"
        name                          = "nomis_rhel_7_9_oracledb_11_2_0_0_7"
      ~ resource_tags                 = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                           = "feature/DSOS-1460" -> "main"
          ~ "is-production"                    = "false" -> "true"
            # (12 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 2 to change, 4 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```